/* შექმენით React აპლიკაცია -npm create vite@latest
კომენტარებით  ახსენით რა არის  React-ი , ახსენით რა არის კომპონენტი React ში და რა უპირატესობა აქვს მას HTML ის ჩვეულებრივ კოდთან შედარებით.  ახსენით რა რა არის .jsx და .tsx  და რა ტიპის კოდები იწერება შიგნით */ 

/* React არის JavaScript ბიბლიოთეკა რომელიც გამოიყენება მომხმარებლის ინტერფეისების (UI) შექმნისთვის. ის საშუალებას აძლევს დეველოპერებს შექმნან კომპონენტებზე დაფუძნებული აპლიკაციები, სადაც თითოეული კომპონენტი არის დამოუკიდებელი და ხელმისაწვდომი სხვა კომპონენტებისთვის. */