/*3) კლასი რამდენიმე ფუნქციით

შექმენით კლასი, რომელიც შეიცავს 3 ფუნქციას:

ერთი ფუნქცია უნდა დააბრუნოს კლასი/ობიექტის სახელი.

მეორე ფუნქცია უნდა გამოიტანოს ასაკი.

მესამე ფუნქცია უნდა იყოს getter, რომელიც დაგიბრუნებთ სრულ აღწერას (სახელი, ასაკი, ქალაქი).

ეს სამი ფუნქცია უნდა მუშაობდეს ერთად, რათა კლასში არსებული მონაცემები მიიღოთ. */

class User {
    constructor(name, age, city) {
        this.name = name;
        this.age = age;
        this.city = city;
    }
}
const user1  = new User("ლიზი", 28, "თბილისი");