'''
    შექმენი ფუნქცია, რომელიც მიიღებს ტექსტს და გამოითვლის,
    რამდენი სიტყვაა ამ ტექსტში.
'''

def words(text):
           words = text.split(' ')
           return len(words)

text = "random words"
print(words(text))



'''
    შექმენი პროგრამა, რომელიც იფუნქციონირებს შემდეგნაირად: 
    მომხმარებლის შეყვანილი რიცხვი იქნება დადებითი, 
    უარყოფითი, ან ნულოვანი, და შესაბამისი შეტყობინება 
    უნდა გამოიტანოს.
'''

num = int(input("enter number: "))

if num > 0:
    print("positive")

elif num < 0:
    print("negative")
else:
      print("zero")



'''
    შექმენი პროგრამა, რომელიც მიიღებს მომხმარებლის 
    ასაკს და დააბრუნებს შეტყობინებას იმის მიხედვით, 
    თუ რომელ ასაკობრივ კატეგორიაშია მომხმარებელი.
'''

age = int(input('შეიყვანეთ თქვენი ასაკი: '))

if age < 18:
    print('თქვენ უმცირესი ბრძანდებით.')
elif age >= 18 and age <= 64:
    print('თქვენ ზრდასრული ბრძანდებით.')
else:
    print('თქვენ უხუცესი ბრძანდებით.')